app/channels/messages_channel.rb

  def subscribed
    stream_from 'messages'

    ActionCable.server.broadcast('messages', { messages: Message.all })
---
SELECT "messages".* FROM "messages"