app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "omg"], ["created_at", "2021-10-04 22:38:36.190691"], ["updated_at", "2021-10-04 22:38:36.190691"]]
SELECT "messages".* FROM "messages"
---
  def create
    Message.create(content: params[:message])
    ActionCable.server.broadcast('messages', { messages: Message.all })