app/controllers/photos_controller.rb

  def index
    @photo = Photo.order('created_at').last  # TODO  pick the right one
---
SELECT  "photos".* FROM "photos"  ORDER BY created_at DESC LIMIT 1

  def create
    @photo = Photo.new(photo_params)
    if @photo.save
---
INSERT INTO "photos" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)